# Fictitious Names

### Step 2. Create the 3 DataFrames based on the following raw data

In [1]:
# Estos son 3 diccionarios
raw_data_1 = {
        'subject_id': ['1', '2', '3', '4', '5'],
        'first_name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
        'last_name': ['Anderson', 'Ackerman', 'Ali', 'Aoni', 'Atiches']}
raw_data_2 = {
        'subject_id': ['4', '5', '6', '7', '8'],
        'first_name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
        'last_name': ['Bonder', 'Black', 'Balwner', 'Brice', 'Btisan']}
raw_data_3 = {
        'subject_id': ['1', '2', '3', '4', '5', '7', '8', '9', '10', '11'],
        'test_id': [51, 15, 15, 61, 16, 14, 15, 1, 61, 16]}

In [2]:
import numpy as np
import pandas as pd

### Step 3. Assign each to a variable called data1, data2, data3

In [3]:
# Dataframe 1
df_data1 = pd.DataFrame(raw_data_1)
df_data1

  subject_id first_name last_name
0          1       Alex  Anderson
1          2        Amy  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          5     Ayoung   Atiches

In [4]:
# Dataframe 2
df_data2 = pd.DataFrame(raw_data_2)
df_data2

  subject_id first_name last_name
0          4      Billy    Bonder
1          5      Brian     Black
2          6       Bran   Balwner
3          7      Bryce     Brice
4          8      Betty    Btisan

In [5]:
# Dataframe 3
df_data3 = pd.DataFrame(raw_data_3)
df_data3

  subject_id  test_id
0          1       51
1          2       15
2          3       15
3          4       61
4          5       16
5          7       14
6          8       15
7          9        1
8         10       61
9         11       16

### Step 4. Join the two first dataframes along rows and assign to all_data

In [10]:
# Join along rows
# axis es 0 por defecto
# vemos que el índice implicito se reinicia, con ignore_index=True tendremos el indice completo
df_all_data = pd.concat([df_data1, df_data2], ignore_index=True)
df_all_data

  subject_id first_name last_name
0          1       Alex  Anderson
1          2        Amy  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          5     Ayoung   Atiches
5          4      Billy    Bonder
6          5      Brian     Black
7          6       Bran   Balwner
8          7      Bryce     Brice
9          8      Betty    Btisan

In [42]:
df_all_data2 = pd.concat([df_data1, df_data2], join="outer")
df_all_data2

  subject_id first_name last_name
0          1       Alex  Anderson
1          2        Amy  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          5     Ayoung   Atiches
0          4      Billy    Bonder
1          5      Brian     Black
2          6       Bran   Balwner
3          7      Bryce     Brice
4          8      Betty    Btisan

### Step 5. Join the two first dataframes along columns and assing to all_data_col

In [14]:
# Join along columns
# Tenemos todas las columnas dup
df_all_data_col = pd.concat([
    df_data1.rename(columns={
        "first_name": "first_name_X",
        "subject_id": "subject_id_X",
        "last_name": "last_name_X"
    }),
    df_data2
], axis=1)

df_all_data

  subject_id first_name last_name
0          1       Alex  Anderson
1          2        Amy  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          5     Ayoung   Atiches
5          4      Billy    Bonder
6          5      Brian     Black
7          6       Bran   Balwner
8          7      Bryce     Brice
9          8      Betty    Btisan

### Step 6. Print the unique values of data3

In [44]:
df_data3["subject_id"].unique()

array(['1', '2', '3', '4', '5', '7', '8', '9', '10', '11'], dtype=object)

In [45]:
df_data3["test_id"].unique()

array([51, 15, 61, 16, 14,  1])

In [15]:
df_data3["test_id"].drop_duplicates()

0    51
1    15
3    61
4    16
5    14
7     1
Name: test_id, dtype: int64

In [17]:
df_data3.drop_duplicates(["test_id"])

  subject_id  test_id
0          1       51
1          2       15
3          4       61
4          5       16
5          7       14
7          9        1

In [18]:
df_data3.drop_duplicates("test_id")

  subject_id  test_id
0          1       51
1          2       15
3          4       61
4          5       16
5          7       14
7          9        1

### Step 7. Merge all_data and data3 along the subject_id value

In [ ]:
# No haria falta, por defect coge la unica columna comun, on='subject_id'
# No haria falta tampoco how, ya que por defecto es inner
df_all_data_final = pd.merge(df_all_data, df_data3, on='subject_id', how="inner")
df_all_data_final

  subject_id first_name last_name  test_id
0          1       Alex  Anderson       51
1          2        Amy  Ackerman       15
2          3      Allen       Ali       15
3          4      Alice      Aoni       61
4          5     Ayoung   Atiches       16
5          4      Billy    Bonder       61
6          5      Brian     Black       16
7          7      Bryce     Brice       14
8          8      Betty    Btisan       15

In [23]:
df_all_data_final_02 = pd.concat([df_all_data, df_data3], axis=1)
df_all_data_final_02

  subject_id first_name last_name subject_id  test_id
0          1       Alex  Anderson          1       51
1          2        Amy  Ackerman          2       15
2          3      Allen       Ali          3       15
3          4      Alice      Aoni          4       61
4          5     Ayoung   Atiches          5       16
5          4      Billy    Bonder          7       14
6          5      Brian     Black          8       15
7          6       Bran   Balwner          9        1
8          7      Bryce     Brice         10       61
9          8      Betty    Btisan         11       16

### Step 8. Merge only the data that has the same 'subject_id' on both data1 and data2

In [ ]:
# Vemos de inicio que tenemos diferentes alumnos con el mismo subject_id en dataframes diferentes

In [24]:
df_merged_df1_df2 = pd.merge(df_data1, df_data2, on='subject_id', how="inner", suffixes=["Vitoria'", "Bilbao"])
df_merged_df1_df2

,subject_id,first_nameVitoria',last_nameVitoria',first_nameBilbao,last_nameBilbao
0,4,Alice,Aoni,Billy,Bonder
1,5,Ayoung,Atiches,Brian,Black

### Step 9. Merge all values in data1 and data2, with matching records and not matching records from both sides where available.

In [ ]:
# indicator=True, argumento que nos ayuda a identificar de dónde viene cada fila
df_merged_df1_df2_all = pd.merge(df_data1, df_data2, 
                                 on='subject_id', how="outer", 
                                 suffixes=["Vitoria'", "Bilbao"],
                                 indicator=True)
df_merged_df1_df2_all

,subject_id,first_nameVitoria',last_nameVitoria',first_nameBilbao,last_nameBilbao,_merge
0,1,Alex,Anderson,NaN,NaN,left_only
1,2,Amy,Ackerman,NaN,NaN,left_only
2,3,Allen,Ali,NaN,NaN,left_only
3,4,Alice,Aoni,Billy,Bonder,both
4,5,Ayoung,Atiches,Brian,Black,both
5,6,NaN,NaN,Bran,Balwner,right_only
6,7,NaN,NaN,Bryce,Brice,right_only
7,8,NaN,NaN,Betty,Btisan,right_only